## SQLite-tehtävät

#### Tehtävä 1. Lisää tarvittavat kirjastot ja tee `testi.db` niminen tietokanta (SQLite3)

In [1]:
#
import sqlite3
import pandas as pd

In [2]:
db_testi  = sqlite3.connect("testi.db")

#### Tehtävä 2. Luo yhteys tietokantaan

In [3]:
connection = db_testi.cursor()

#### Tehtävä 3. Tee tietokantaan seuraavanlainen taulu, jonka nimi on `henkilotaulu`:
    
| Nimi        | Ika           | Kengankoko  |
| ------------- |-------------| -----|
| Teppo      | 88 | 47 |
| Matti      | 34     | 39 |
| Ilona | 41      |    36 |
| Sonja | 32      |    37 |

In [4]:
# Taulu kolmella sarakkeella
connection.execute("""CREATE TABLE if not exists henkilotaulu (Nimi, Ika, Kengankoko)""")

# Tietokantaan lisättävä data
data_rows = [("Teppo", 88, 47), ("Matti", 34, 39), ("Ilona", 41, 36), ("Sonja", 32, 37)]

# Datarivien lisääminen
for data_row in data_rows:
    connection.execute('''INSERT INTO henkilotaulu VALUES {0}'''.format(data_row))

# Tallennetaan muutokset
db_testi.commit()

#### Tehtävä 4. Kun Taulu on tehty, niin hae taulu Pandasin DataFrame-objektiin ja lisää siihen sarake `Hatunkoko`, jonka jälkeen täytä se valitsemillasi arvoilla

In [5]:
# Sql-kysely, millä haetaan kaikki data taulusta
sql_query = '''SELECT * FROM henkilotaulu'''

# Käytetään jo aiemmin luotua database_connection yhteyttä ja suoritetaan sql_query sql-komento, jolla haetaan kaikki data Elain taulusta
dataframe_from_sqlite = pd.read_sql(sql_query, db_testi)

# Katostaan datakehyksen sisältö
dataframe_from_sqlite

    Nimi  Ika  Kengankoko
0  Teppo   88          47
1  Matti   34          39
2  Ilona   41          36
3  Sonja   32          37

In [6]:
# Haettuun kehykseen kahden rivin lisääminen uudessa kehyksessä

koot = [58,57,54,55]
# df.assign(Hatunkoko=koot)
dataframe_from_sqlite = dataframe_from_sqlite.assign(Hatunkoko=koot)
dataframe_from_sqlite

# df

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88          47         58
1  Matti   34          39         57
2  Ilona   41          36         54
3  Sonja   32          37         55

#### Tehtävä 5. Tee DataFrame-objektista kopio, jonka nimi on `henkilotaulukopio` ja lisää siihen rivi valitsemillasi arvoilla. Tallenna tämä muokattu dataframe-objekti nyt tietokantaan nimellä `henkilotaulukopio` (tulee edellisen taulun rinnalle).

In [7]:
#
henkilotaulukopio = dataframe_from_sqlite.copy()
henkilotaulukopio = henkilotaulukopio.append(pd.DataFrame({"Nimi":["Peppi"], "Ika":[12], "Kengankoko":[35], "Hatunkoko":[53]}))
henkilotaulukopio.to_sql(name="henkilotaulukopio", con=db_testi, if_exists='fail', index=False)
henkilotaulukopio

C:\Users\Jouni\AppData\Local\Temp\ipykernel_17556\2425467174.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  henkilotaulukopio = henkilotaulukopio.append(pd.DataFrame({"Nimi":["Peppi"], "Ika":[12], "Kengankoko":[35], "Hatunkoko":[53]}))

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88          47         58
1  Matti   34          39         57
2  Ilona   41          36         54
3  Sonja   32          37         55
0  Peppi   12          35         53

In [8]:
sql_query = '''SELECT * FROM henkilotaulukopio'''
henkilotaulukopio = pd.read_sql(sql_query, db_testi)
henkilotaulukopio

    Nimi  Ika  Kengankoko  Hatunkoko
0  Teppo   88          47         58
1  Matti   34          39         57
2  Ilona   41          36         54
3  Sonja   32          37         55
4  Peppi   12          35         53

#### Tehtävä 6. Tallenna lopuksi tietokannan muutokset ja sulje yhteys

In [9]:
#
db_testi.commit()
db_testi.close()